# -*- coding: utf-8 -*-
"""

============================================================


============================================================
"""

import math


def solve_h(data):
    # ===============================
    # 輸入端（圖面角度）
    # ===============================
    B1 = float(data["未端斜度W"]) 
    angle_deg = float(data["角度2"]) 
    B3  = float(data["內端小徑X"]) 
    B4  = float(data["前端x軸內徑"])
    X_end = (B3-B4)/2

    X0=0.
    Z0=0.
    angle = math.radians(angle_deg)
    

    # ===============================
    # 角度鎖定
    # ===============================
    if angle_deg <= 0 or angle_deg >= 90:
        raise ValueError("角度 A 必須介於 0 ~ 90 度")
        
    if B3 <= B4:
        raise ValueError(" 內徑d-2 不可小於或等於 內徑d-1")
    # ===============================
    # 計算（終點端 Z，反邊修正後）
    # ===============================
    dX = X_end - X0          # X 向上為正
    dZ =  dX / math.tan(angle)  # 往左 → Z 負

    Z_end = Z0 + dZ
    # ===============================
    # 輸出
    # ===============================   
    H01=dZ

    H02=H01+B1
    H03=Z_end

    def _fmt(x):
    # 例如固定顯示到小數點兩位
        return f"{x:.3f}"
    
    result_values = {
        "H02": H02,
        "H03": H03,
          
     }

    text_lines = [
        "➡️ 前端斜角 → 平線 → 終點弧（C 工廠）",
        f"H02 = {_fmt(H02)}",
        f"H03 = {_fmt(H03)}",
      
    ]

    return {
        "ok": True,
        "text_lines": text_lines,
        "values": result_values,
    }


# -------------------------------------------------------
# 🔁 對外統一介面
# -------------------------------------------------------
def solve(data: dict):
    return solve_h(data)
